касса_Вегас/src/Enums/ПризнакиПредметаРасчета/ПризнакиПредметаРасчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПризнакиПредметаРасчета</name>
  <enumValues>
    <name>Товар</name>
    <comment>Реализуемый товар, за исключением подакцизного товара</comment>
  </enumValues>
  <enumValues>
    <name>ПодакцизныйТовар</name>
    <comment>Реализуемый подакцизный товар</comment>
  </enumValues>
  <enumValues>
    <name>Работа</name>
    <comment>Выполняемая работа</comment>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
    <comment>Оказываемая услуга</comment>
  </enumValues>
  <enumValues>
    <name>СтавкаАзартнойИгры</name>
    <comment>Прием ставок при осуществлении деятельности по проведению азартных игр</comment>
  </enumValues>
  <enumValues>
    <name>ВыигрышАзартнойИгры</name>
    <comment>Выплата денежных средств в виде выигрыша при осуществлении деятельности по проведению азартных игр</comment>
  </enumValues>
  <enumValues>
    <name>ЛотерейныйБилет</name>
    <comment>Прием денежных средств при реализации лотерейных билетов</comment>
  </enumValues>
  <enumValues>
    <name>ВыигрышЛотереи</name>
    <comment>Выплата денежных средств в виде выигрыша при осуществлении деятельности по проведению лотерей</comment>
  </enumValues>
  <enumValues>
    <name>ПредоставлениеРИД</name>
    <comment>Предоставлении прав на использование результатов интеллектуальной деятельности или средств индивидуализации</comment>
  </enumValues>
  <enumValues>
    <name>ПлатежВыплата</name>
    <comment>Аванс, задаток, предоплата, кредит, взнос в счет оплаты, пени, штраф, вознаграждение, бонус и ином аналогичном предмете расчета</comment>
  </enumValues>
  <enumValues>
    <name>АгентскоеВознаграждение</name>
    <comment>Вознаграждение пользователя, являющегося платежным агентом (субагентом), банковским платежным агентом (субагентом), комиссионером, поверенным или иным агентом</comment>
  </enumValues>
  <enumValues>
    <name>СоставнойПредметРасчета</name>
    <comment>Предмет расчета, состоящем из предметов, каждому из которых может быть присвоено другие значения перечисления</comment>
  </enumValues>
  <enumValues>
    <name>ИнойПредметРасчета</name>
    <comment>Предмет расчета,  не относящемуся к предметам расчета, которым может быть присвоено значение перечисления</comment>
  </enumValues>
  <enumValues>
    <name>ИмущественноеПраво</name>
    <comment>Передача имущественных прав</comment>
  </enumValues>
  <enumValues>
    <name>ВнереализационныйДоход</name>
    <comment>Внереализационный доход</comment>
  </enumValues>
  <enumValues>
    <name>СтраховыеВзносы</name>
    <comment>Сумма расходов, уменьшающих сумму налога (авансовых платежей) в соответствии с пунктом 3.1 статьи 346.21 Налогового кодекса РФ</comment>
  </enumValues>
  <enumValues>
    <name>ТорговыйСбор</name>
    <comment>Сумма уплаченного торгового сбора</comment>
  </enumValues>
  <enumValues>
    <name>КурортныйСбор</name>
    <comment>Курортный сбор</comment>
  </enumValues>
  <enumValues>
    <name>Залог</name>
    <comment>Залог</comment>
  </enumValues>
</mdclass:Enum>

касса_Вегас/src/Enums/ПризнакиАгента/ПризнакиАгента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПризнакиАгента</name>
  <enumValues>
    <name>БанковскийПлатежныйАгент</name>
    <comment>Оказание услуг покупателю (клиенту) пользователем, являющимся банковским платежным агентом</comment>
  </enumValues>
  <enumValues>
    <name>БанковскийПлатежныйСубагент</name>
    <comment>Оказание услуг покупателю (клиенту) пользователем, являющимся банковским платежным субагентом</comment>
  </enumValues>
  <enumValues>
    <name>ПлатежныйАгент</name>
    <comment>Оказание услуг покупателю (клиенту) пользователем, являющимся платежным агентом</comment>
  </enumValues>
  <enumValues>
    <name>ПлатежныйСубагент</name>
    <comment>Оказание услуг покупателю (клиенту) пользователем, являющимся платежным субагентом</comment>
  </enumValues>
  <enumValues>
    <name>Поверенный</name>
    <comment>Осуществление расчета с покупателем (клиентом) пользователем, являющимся поверенным</comment>
  </enumValues>
  <enumValues>
    <name>Комиссионер</name>
    <comment>Осуществление расчета с покупателем (клиентом) пользователем, являющимся комиссионером</comment>
  </enumValues>
  <enumValues>
    <name>Агент</name>
    <comment>Осуществление расчета с покупателем (клиентом) пользователем, являющимся агентом и не являющимся банковским платежным агентом (субагентом), платежным агентом (субагентом), поверенным, комиссионером</comment>
  </enumValues>
</mdclass:Enum>

касса_Вегас/src/Enums/СистемыНалогообложения/СистемыНалогообложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СистемыНалогообложения</name>
  <enumValues>
    <name>Общая</name>
  </enumValues>
  <enumValues>
    <name>УпрощеннаяДоход</name>
    <comment>УСН</comment>
  </enumValues>
  <enumValues>
    <name>УпрощеннаяДоходМинусРасход</name>
    <comment>УСН</comment>
  </enumValues>
  <enumValues>
    <name>ЕдиныйНалогНаВмененныйДоход</name>
  </enumValues>
  <enumValues>
    <name>ЕдиныйСельскохозяйственныйНалог</name>
  </enumValues>
  <enumValues>
    <name>Патентная</name>
    <comment>Патентная система налогообложения</comment>
  </enumValues>
</mdclass:Enum>

касса_Вегас/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <enumValues>
    <name>БезНДС</name>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
  </enumValues>
  <enumValues>
    <name>НДС10_110</name>
  </enumValues>
  <enumValues>
    <name>НДС18</name>
  </enumValues>
  <enumValues>
    <name>НДС18_118</name>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
  </enumValues>
  <enumValues>
    <name>НДС20_120</name>
  </enumValues>
</mdclass:Enum>

касса_Вегас/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>АлкогольнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидАлкогольнойПродукции</name>
    <type>
      <types>CatalogRef.ВидыАлкогольнойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеАгента</name>
    <type>
      <types>CatalogRef.ДанныеАгентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеПоставщика</name>
    <type>
      <types>CatalogRef.ДанныеПоставщиков</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Избранное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИННПроизводителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодВидаАлкогольнойПродукции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПППроизводителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Крепость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаркируемаяАлкогольнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемАлкогольнойПродукции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакПредметаРасчета</name>
    <type>
      <types>EnumRef.ПризнакиПредметаРасчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Секция</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипМаркировки</name>
    <type>
      <types>EnumRef.ТипыМаркировкиККТ</types>
    </type>
  </attributes>
</mdclass:Catalog>

касса_Вегас/src/CommonModules/ОбщегоНазначенияПовтИсп/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ФорматСуммовыхПолей() Экспорт
	
	ФорматПолей = "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧН=0.00; ЧГ=0";
	
	Возврат ФорматПолей;
	
КонецФункции

Функция ПолучитьСоздатьЕдиницуИзмерения(Наименование) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		Наименование ="шт";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЕдиницыИзмерения.Ссылка
	|ИЗ
	|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|ГДЕ
	|	ЕдиницыИзмерения.Наименование ПОДОБНО &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЕдиницаИзмерения = Выборка.Ссылка;
	Иначе
		ЕдиницаИзмеренияОбъект = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
		ЕдиницаИзмеренияОбъект.Наименование = Наименование;
		ЕдиницаИзмеренияОбъект.НаименованиеПолное = Наименование;
		ЕдиницаИзмеренияОбъект.Записать();
		ЕдиницаИзмерения = ЕдиницаИзмеренияОбъект.Ссылка;
	КонецЕсли;
	
	Возврат ЕдиницаИзмерения;
	
КонецФункции

Функция ПолучитьЕдиницуИзмерения(Наименование, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Если ЗначениеПоУмолчанию = Неопределено Тогда
		ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.ПустаяСсылка();
	Иначе
		ЕдиницаИзмерения = ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЕдиницыИзмерения.Ссылка
	|ИЗ
	|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|ГДЕ
	|	ЕдиницыИзмерения.Наименование ПОДОБНО &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЕдиницаИзмерения = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат ЕдиницаИзмерения;
	
КонецФункции

Функция ПолучитьГруппуТоваров(Наименование, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Если ЗначениеПоУмолчанию = Неопределено Тогда
		Группа = Справочники.ЕдиницыИзмерения.ПустаяСсылка();
	Иначе
		Группа = ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Наименование ПОДОБНО &Наименование
	|	И Номенклатура.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Группа = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Группа;
	
КонецФункции

Функция ПолучитьВидАлкогольнойПродукцииПоКоду(КодАлкогольнойПродукции) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыАлкогольнойПродукции.Ссылка КАК ВидыАлкогольнойПродукции
	|ИЗ
	|	Справочник.ВидыАлкогольнойПродукции КАК ВидыАлкогольнойПродукции
	|ГДЕ
	|	ВидыАлкогольнойПродукции.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", КодАлкогольнойПродукции);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ВидыАлкогольнойПродукции;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьПризнакПредметаРасчетаПоКоду(КодПризнакаПредметаРасчета) Экспорт
	
	Если КодПризнакаПредметаРасчета = 1 Тогда
		
		ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Товар;
		
	ИначеЕсли КодПризнакаПредметаРасчета = 2 Тогда
		ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ПодакцизныйТовар;
		
	ИначеЕсли КодПризнакаПредметаРасчета = 3 Тогда
		ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Работа;
		
	ИначеЕсли КодПризнакаПредметаРасчета = 4 Тогда
		ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Услуга;
		
	ИначеЕсли КодПризнакаПредметаРасчета = 5 Тогда
		ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.СтавкаАзартнойИгры;
		
	ИначеЕсли КодПризнакаПредметаРасчета = 6 Тогда
		ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ВыигрышАзартнойИгры;
		
	ИначеЕсли КодПризнакаПредметаРасчета = 7 Тогда
		ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ЛотерейныйБилет;
		
	ИначеЕсли КодПризнакаПредметаРасчета = 8 Тогда
		ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ВыигрышЛотереи;
		
	ИначеЕсли КодПризнакаПредметаРасчета = 9 Тогда
		ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ПредоставлениеРИД;
		
	ИначеЕсли КодПризнакаПредметаРасчета = 10 Тогда
		ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ПлатежВыплата;
		
	ИначеЕсли КодПризнакаПредметаРасчета = 11 Тогда
		ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.АгентскоеВознаграждение;
		
	ИначеЕсли КодПризнакаПредметаРасчета = 12 Тогда
		ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.СоставнойПредметРасчета;
		
	ИначеЕсли КодПризнакаПредметаРасчета = 13 Тогда
		ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ИнойПредметРасчета;
		
	ИначеЕсли КодПризнакаПредметаРасчета = 14 Тогда
		ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ИмущественноеПраво;
		
	ИначеЕсли КодПризнакаПредметаРасчета = 15 Тогда
		ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ВнереализационныйДоход;
		
	ИначеЕсли КодПризнакаПредметаРасчета = 16 Тогда
		ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.СтраховыеВзносы;
		
	ИначеЕсли КодПризнакаПредметаРасчета = 17 Тогда
		ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ТорговыйСбор;
		
	ИначеЕсли КодПризнакаПредметаРасчета = 18 Тогда
		ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.КурортныйСбор;
		
	ИначеЕсли КодПризнакаПредметаРасчета = 19 Тогда
		ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Залог;
		
	Иначе
		
		ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Товар;
		
	КонецЕсли;
	
	Возврат ПризнакПредметаРасчета;
	
КонецФункции

Функция ПолучитьПризнакАгентаПоКоду(КодПризнакаАгента) Экспорт
	
	Если КодПризнакаАгента = 0 Тогда
		
		Возврат Перечисления.ПризнакиАгента.БанковскийПлатежныйАгент;
		
	ИначеЕсли КодПризнакаАгента = 1 Тогда
		
		Возврат Перечисления.ПризнакиАгента.БанковскийПлатежныйСубагент;
		
	ИначеЕсли КодПризнакаАгента = 2 Тогда
		
		Возврат Перечисления.ПризнакиАгента.ПлатежныйАгент;
		
	ИначеЕсли КодПризнакаАгента = 3 Тогда
		
		Возврат Перечисления.ПризнакиАгента.ПлатежныйСубагент;
		
	ИначеЕсли КодПризнакаАгента = 4 Тогда
		
		Возврат Перечисления.ПризнакиАгента.Поверенный;
		
	ИначеЕсли КодПризнакаАгента = 5 Тогда
		
		Возврат Перечисления.ПризнакиАгента.Комиссионер;
		
	ИначеЕсли КодПризнакаАгента = 6 Тогда
		
		Возврат Перечисления.ПризнакиАгента.Агент;
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСтатусЗаказаПоНаименованию(НаименованиеСтатуса) Экспорт
	
	Возврат Перечисления.СтатусыЗаказовКлиентов.ПолучитьСтатусЗаказаПоНаименованию(НаименованиеСтатуса);
	
КонецФункции

Функция ПолучитьСистемуНалогообложенияККТ(СистемаНалогообложения) Экспорт
	
	Если СистемаНалогообложения = Перечисления.СистемыНалогообложения.Общая Тогда
		
		Возврат Перечисления.ТипыСистемНалогообложенияККТ.ОСН;
		
	ИначеЕсли СистемаНалогообложения = Перечисления.СистемыНалогообложения.УпрощеннаяДоход Тогда
		
		Возврат Перечисления.ТипыСистемНалогообложенияККТ.УСНДоход;
		
	ИначеЕсли СистемаНалогообложения = Перечисления.СистемыНалогообложения.УпрощеннаяДоходМинусРасход Тогда
		
		Возврат Перечисления.ТипыСистемНалогообложенияККТ.УСНДоходРасход;
		
	ИначеЕсли СистемаНалогообложения = Перечисления.СистемыНалогообложения.ЕдиныйНалогНаВмененныйДоход Тогда
		
		Возврат Перечисления.ТипыСистемНалогообложенияККТ.ЕНВД;
		
	ИначеЕсли СистемаНалогообложения = Перечисления.СистемыНалогообложения.ЕдиныйСельскохозяйственныйНалог Тогда
		
		Возврат Перечисления.ТипыСистемНалогообложенияККТ.ЕСН;
		
	ИначеЕсли СистемаНалогообложения = Перечисления.СистемыНалогообложения.Патентная Тогда
		
		Возврат Перечисления.ТипыСистемНалогообложенияККТ.Патент;
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСистемуНалогообложенияПоКоду(КодСистемыНалогообложения) Экспорт
	
	Если КодСистемыНалогообложения = 1 ИЛИ КодСистемыНалогообложения = "1" Тогда
		Возврат Перечисления.СистемыНалогообложения.УпрощеннаяДоход;
		
	ИначеЕсли КодСистемыНалогообложения = 2 ИЛИ КодСистемыНалогообложения = "2" Тогда
		Возврат Перечисления.СистемыНалогообложения.УпрощеннаяДоходМинусРасход;
		
	ИначеЕсли КодСистемыНалогообложения = 3 ИЛИ КодСистемыНалогообложения = "3" Тогда
		Возврат Перечисления.СистемыНалогообложения.ЕдиныйНалогНаВмененныйДоход;
		
	ИначеЕсли КодСистемыНалогообложения = 4 ИЛИ КодСистемыНалогообложения = "4" Тогда
		Возврат Перечисления.СистемыНалогообложения.ЕдиныйСельскохозяйственныйНалог;
		
	ИначеЕсли КодСистемыНалогообложения = 5 ИЛИ КодСистемыНалогообложения = "5" Тогда
		Возврат Перечисления.СистемыНалогообложения.Патентная;
		
	ИначеЕсли КодСистемыНалогообложения = 0 ИЛИ КодСистемыНалогообложения = "0" Тогда
		Возврат Перечисления.СистемыНалогообложения.Общая;
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСтавкуНДСККТ(СтавкаНДС) Экспорт
	
	Если СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
		
		Возврат "none";
		
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС0 Тогда
		
		Возврат "0";
		
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
		
		Возврат "10";
		
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС18 Тогда
		
		Возврат "18";
		
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС18_118 Тогда
		
		Возврат "18/118";
		
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС10_110 Тогда
		
		Возврат "10/110";
		
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
		
		Возврат "20";
		
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС20_120 Тогда
		
		Возврат "20/120";
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьКодТипаСистемыНалогообложенияККТ(СистемаНалогообложенияККТ) Экспорт
	
	Возврат МенеджерОборудованияКлиентСервер.КодСистемыНалогообложенияККТ(СистемаНалогообложенияККТ);
	
КонецФункции

Функция ЭтоПланшет() Экспорт
	
	ЭтоПланшет = Ложь;
	
	#Если МобильноеПриложениеСервер Тогда 
		Попытка
			
			ИнформацияЭкрана = ПолучитьИнформациюЭкрановКлиента();
			DPI		= ИнформацияЭкрана[0].DPI;
			Высота	= ИнформацияЭкрана[0].Высота;
			Ширина	= ИнформацияЭкрана[0].Ширина;
			ВысотаDP = Окр(160 / DPI * Высота);
			ШиринаDP = Окр(160 / DPI * Ширина);
			Диагональ = Окр(Sqrt((Высота/DPI*Высота/DPI)+(Ширина/DPI*Ширина/DPI)));
			Если Диагональ < 7 Тогда  // http://developer.android.com/intl/ru/design/style/metrics-grids.html
				ЭтоПланшет = Ложь;
			Иначе
				ЭтоПланшет = Истина;
			КонецЕсли;
		
		Исключение
			ЭтоПланшет = Ложь;
		КонецПопытки;
			
	#Иначе
		ЭтоПланшет = Истина;
	#КонецЕсли
	
	Возврат ЭтоПланшет;
	
КонецФункции

#КонецОбласти
